{
  "category":[
    {
      "name": "Essential Skills",
      "description": "Learn basic first aid knowledge",
      "topics": [
        {
          "title": "Basic First Aid Techniques",
          "subtopics": [
            {
              "title": "Overview",
              "content": "This section provides a brief introduction to the basic principles of first aid, including the importance of quick and appropriate action in emergency situations.",
              "completed": false
            },
            {
              "title": "Emergency Situations",
              "content": "This section outlines the steps to follow in an emergency situation, including how to call for help and how to stay calm and focused.",
              "completed": false
            },
            {
              "title": "Primary Assessment",
              "content": "This section provides an overview of the primary assessment process, which is used to determine the nature of the injury or illness and the appropriate course of action.",
              "completed": false
            },
            {
              "title": "ABCs of First Aid",
              "content": "This section explains the importance of the ABCs of first aid, which stands for Airway, Breathing, and Circulation, and provides instructions on how to perform these life-saving techniques.",
              "completed": false
            },
            {
              "title": "Treating Injuries",
              "content": "This section covers the basics of how to administer first aid for different types of injuries, such as cuts, burns, fractures, and sprains, including how to recognize and respond to each type of injury.",
              "completed": false
            }
          ]
        },
        {
          "title": "CPR and AED Training",
          "subtopics": [
            {
              "title": "Introduction to CPR",
              "content": "This section provides an overview of what CPR is and why it is important in emergency situations.",
              "completed": false
            },
            {
              "title": "Chest Compressions and Rescue Breaths",
              "content": "This section provides step-by-step instructions on how to perform chest compressions and rescue breaths in CPR.",
              "completed": false
            },
            {
              "title": "Using an AED",
              "content": "This section explains when and how to use an automated external defibrillator (AED) in CPR.",
              "completed": false
            },
            {
              "title": "CPR on Infants and Children",
              "content": "This section explains how to perform CPR on infants and children, including the differences from adult CPR.",
              "completed": false
            },
            {
              "title": "Recognizing Cardiac Arrest",
              "content": "This section explains how to recognize the signs of cardiac arrest and how to respond appropriately.",
              "completed": false
            }
          ]
        },
        {
          "title": "Common Medical Emergencies",
          "subtopics": [
            {
              "title": "Overview",
              "content": "This section provides an overview of the most common medical emergencies and how to recognize them.",
              "completed": false
            },
            {
              "title": "Heart Attack, Stroke, and Diabetic Emergency",
              "content": "This section covers how to respond to a heart attack, stroke, or diabetic emergency, including what to do before medical help arrives.",
              "completed": false
            },
            {
              "title": "Seizure and Allergic Reaction",
              "content": "This section covers how to recognize and respond to a seizure or allergic reaction, including administering first aid and seeking medical help if necessary.",
              "completed": false
            },
            {
              "title": "Panic Attack and Fainting",
              "content": "This section covers what to do if someone is experiencing a panic attack or fainting, including how to provide comfort and support.",
              "completed": false
            },
            {
              "title": "Heat Exhaustion and Hypothermia",
              "content": "This section covers how to recognize the signs of heat exhaustion or hypothermia and how to respond appropriately, including first aid techniques and seeking medical attention.",
              "completed": false
            }
          ]
        },
        {
          "title": "How to Treat Burns and Cuts",
          "subtopics": [
            {
              "title": "Recognizing Burns and Cuts",
              "content": "Learn to differentiate between first-degree, second-degree, and third-degree burns and how to identify different types of cuts",
              "completed": false
            },
            {
              "title": "Immediate Care",
              "content": "Understand the immediate care steps to be taken after experiencing a burn or a cut, such as stopping the bleeding, cleaning the wound, and covering it to prevent infection",
              "completed": false
            },
            {
              "title": "Medical Attention",
              "content": "Know when it is necessary to seek medical attention for burns or cuts and how to find medical help if required",
              "completed": false
            },
            {
              "title": "Preventing Infection and Promoting Healing",
              "content": "Learn how to prevent infection and promote healing in burns and cuts by using over-the-counter treatments or natural remedies",
              "completed": false
            },
            {
              "title": "Controlling Bleeding",
              "content": "Discover how to use a tourniquet or apply pressure to control bleeding in serious cuts or wounds",
              "completed": false
            }
          ]
        }
      ]
    },
    {
      "name": "Self First Aid",
      "description": "Help yourself when you are alone",
      "topics": [
        {
          "title": "Bleeding and Wound Care",
          "subtopics": [
            {
              "title": "Treating Minor Cuts and Scrapes",
              "content": "Clean the wound with soap and water, apply an antiseptic, and cover with a bandage.",
              "completed": false
            },
            {
              "title": "Applying Pressure to Stop Bleeding",
              "content": "Apply firm pressure to the wound with a clean cloth or bandage.",
              "completed": false
            },
            {
              "title": "Using a Tourniquet",
              "content": "Only use a tourniquet as a last resort to stop severe bleeding. Apply it 2-3 inches above the wound, tighten until the bleeding stops, and seek medical help immediately.",
              "completed": false
            },
            {
              "title": "Cleaning and Dressing Wounds",
              "content": "Clean the wound thoroughly with water and a mild soap, apply an antiseptic ointment, and cover with sterile gauze and tape.",
              "completed": false
            }
          ]
        },
        {
          "title": "Burns and Scalds",
          "subtopics": [
            {
              "title": "Identifying Different Types of Burns",
              "content": "First-degree burns only affect the top layer of skin and appear red and dry. Second-degree burns involve the first and second layers of skin and appear red, blistered, and painful. Third-degree burns are the most severe and involve all layers of skin and the underlying tissue.",
              "completed": false
            },
            {
              "title": "Cooling and Soothing Burned Skin",
              "content": "Run cool (not cold) water over the burn for several minutes, or apply a cool compress. Use aloe vera, hydrocortisone cream, or an antibiotic ointment to soothe the burn.",
              "completed": false
            },
            {
              "title": "Knowing When to Seek Medical Help",
              "content": "Seek medical help if the burn is larger than 3 inches, affects the face, hands, feet, or genitals, or if it is a third-degree burn.",
              "completed": false
            }
          ]
        },
        {
          "title": "Choking and Suffocation",
          "subtopics": [
            {
              "title": "Performing the Heimlich Maneuver on Yourself",
              "content": "Learn how to perform the Heimlich maneuver on yourself if you are choking and there is no one else around to help you.",
              "completed": false
            },
            {
              "title": "Clearing a Blocked Airway",
              "content": "Learn how to clear a blocked airway by performing back blows and abdominal thrusts.",
              "completed": false
            },
            {
              "title": "Recognizing the Signs of Suffocation",
              "content": "Learn how to recognize the signs of suffocation, which can include gasping for air, blue lips or face, and loss of consciousness.",
              "completed": false
            },
            {
              "title": "Avoiding Choking Hazards",
              "content": "Learn how to avoid choking hazards, such as small toys, foods, and objects that can easily become lodged in the throat.",
              "completed": false
            }
          ]
        },
        {
          "title": "Poisoning and Overdose",
          "subtopics": [
            {
              "title": "Knowing Common Household Poisons",
              "content": "Learn about the common household poisons and how to prevent poisoning.",
              "completed": false
            },
            {
              "title": "Recognizing the Symptoms of Poisoning",
              "content": "Learn how to recognize the symptoms of poisoning, which can include nausea, vomiting, abdominal pain, and difficulty breathing.",
              "completed": false
            },
            {
              "title": "Contacting Emergency Services",
              "content": "Learn how to contact emergency services in case of poisoning or overdose.",
              "completed": false
            },
            {
              "title": "Administering Medication for Overdose",
              "content": "Learn how to administer medication, such as naloxone, in case of overdose.",
              "completed": false
            }
          ]
        },
        {
          "title": "Sprains and Strains",
          "subtopics": [
            {
              "title": "Recognizing the Difference Between Sprains and Strains",
              "content": "Learn how to differentiate between sprains and strains and how to treat them.",
              "completed": false
            },
            {
              "title": "Resting and Elevating the Affected Area",
              "content": "Learn how to rest and elevate the affected area to reduce swelling and pain.",
              "completed": false
            },
            {
              "title": "Applying Ice and Compression",
              "content": "Learn how to apply ice and compression to the affected area to reduce swelling and pain.",
              "completed": false
            },
            {
              "title": "Knowing When to Seek Medical Help",
              "content": "Learn how to recognize when it is necessary to seek medical help for sprains and strains.",
              "completed": false
            }
          ]
        },
        {
          "title": "Heatstroke and Hypothermia",
          "subtopics": [
            {
              "title": "Recognizing the Symptoms of Heatstroke and Hypothermia",
              "content": "Learn how to recognize the symptoms of heatstroke and hypothermia, which can include fatigue, dizziness, nausea, and confusion.",
              "completed": false
            },
            {
              "title": "Taking Steps to Cool Down or Warm Up",
              "content": "Learn how to take appropriate steps to cool down or warm up the body depending on the condition.",
              "completed": false
            },
            {
              "title": "Avoiding Extreme Temperatures",
              "content": "Learn how to avoid extreme temperatures to prevent heatstroke and hypothermia.",
              "completed": false
            },
            {
              "title": "Knowing When to Seek Medical Help",
              "content": "Learn how to recognize when it is necessary to seek medical help for heatstroke and hypothermia.",
              "completed": false
            }
          ]
        },
        {
          "title": "Allergic Reactions",
          "subtopics": [
            {
              "title": "Recognizing the Signs of an Allergic Reaction",
              "content": "Learn how to recognize the signs of an allergic reaction, which can include hives, swelling, difficulty breathing, and anaphylaxis.",
              "completed": false
            },
            {
              "title": "Administering Self-Injectable Epinephrine",
              "content": "Learn how to administer self-injectable epinephrine in case of an allergic reaction.",
              "completed": false
            },
            {
              "title": "Taking Antihistamines or Other Medications",
              "content": "Learn how to take antihistamines or other medications to manage mild to moderate allergic reactions.",
              "completed": false
            },
            {
              "title": "Avoiding Triggers and Allergens",
              "content": "Learn how to avoid triggers and allergens that can cause an allergic reaction.",
              "completed": false
            }
          ]
        }
      ]
    },
    {
      "name": "Infant & Child First Aid",
      "description": "For parents and babysitters",
      "topics": []
    },
    {
      "name": "Sports Injuries",
      "description": "What all sportsmen need to know",
      "topics": []
    },
    {
      "name": "Mental Health Aid",
      "description": "Identify the signs and learn to respond",
      "topics": []
    }
  ]
}
